Documents/Рин1_НазначениеСотрудниковНаВРЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>Рин1_НазначениеСотрудниковНаВРЦ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Рин1_НазначенияСотрудниковВРЦ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьНазначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсвободитьОтНазначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Рин1_НазначенияСотрудниковВРЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>Рин1_НазначенияСотрудниковВРЦ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВРЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсвободитьОтНазначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Рин1_НазначениеСотрудниковНаВРЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не РольДоступна("Рин1_ДобавлениеИзменениеНазначенийСотрудниковНаВРЦ") Тогда	
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьНазначенийВРЦОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//СтруктураИзЗапроса = КоличествоРабочихЦентров(ВыбранноеЗначение);
	//
	//Если СтруктураИзЗапроса = Неопределено Тогда
	//	ТекущийЭлемент.ТекущиеДанные.ВРЦ = ВыбранноеЗначение;
	//Иначе 
	//	Если СтруктураИзЗапроса.ОсталосьРабочихЦентров < 1 Тогда
	//		Сообщить("Лимит рабочих центров для выбранного врц равен " + СтруктураИзЗапроса.КоличествоРабочихЦентров + " и он исчерпан. Назначение сотрудника не возможно!");
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КоличествоРабочихЦентров(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРабочихЦентров.КоличествоРабочихЦентров КАК КоличествоРабочихЦентров,
		|	ВидыРабочихЦентров.КоличествоРабочихЦентров - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Рин1_НазначенияСотрудниковВРЦСрезПоследних.Сотрудник) КАК ОсталосьРабочихЦентров
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Рин1_НазначенияСотрудниковВРЦ.СрезПоследних(, ВРЦ = &ВРЦ) КАК Рин1_НазначенияСотрудниковВРЦСрезПоследних
		|		ПО (Рин1_НазначенияСотрудниковВРЦСрезПоследних.ВРЦ = ВидыРабочихЦентров.Ссылка)
		|ГДЕ
		|	НЕ Рин1_НазначенияСотрудниковВРЦСрезПоследних.ОсвободитьОтНазначений
		|	И ВидыРабочихЦентров.Ссылка = &ВРЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыРабочихЦентров.КоличествоРабочихЦентров";
	
	Запрос.УстановитьПараметр("ВРЦ", ВыбранноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить(); 
		Возврат Новый Структура("КоличествоРабочихЦентров,ОсталосьРабочихЦентров",Результат[0].КоличествоРабочихЦентров,Результат[0].ОсталосьРабочихЦентров);
	Иначе 
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ТабличнаяЧастьНазначенийОсвободитьОтНазначенийПриИзменении(Элемент)
	
	//Если не ТекущийЭлемент.ТекущиеДанные.ОсвободитьОтНазначений Тогда
	//	СтруктураИзЗапроса = КоличествоРабочихЦентров(ТекущийЭлемент.ТекущиеДанные.ВРЦ);
	//	Если не СтруктураИзЗапроса = Неопределено Тогда
	//		Если СтруктураИзЗапроса.ОсталосьРабочихЦентров < 1 Тогда
	//			ТекущийЭлемент.ТекущиеДанные.ОсвободитьОтНазначений = Истина;
	//			Сообщить("Лимит рабочих центров для выбранного врц равен " + СтруктураИзЗапроса.КоличествоРабочихЦентров + " и он исчерпан. Назначение сотрудника не возможно!");
	//		Иначе
	//			ЗаписьДокумента();
	//		КонецЕсли;
	//	Иначе 
	//		ЗаписьДокумента();
	//	КонецЕсли;
	//Иначе 
	//	ЗаписьДокумента();
	//КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Функция ЗаписьДокумента()
//	
//	ЭтотОбъект.Записать();
//	
//КонецФункции // ЗаписьДокумента()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = КонтрольНазначенныхСотрудников_КоличествуРабочихЦентровВРЦ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонтрольНазначенныхСотрудников_КоличествуРабочихЦентровВРЦ()
	
	ЕстьПревышение = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Сотрудник КАК Сотрудник,
	|	ТЗ.ВРЦ КАК ВРЦ
	|ПОМЕСТИТЬ ВТ_ТекущиеДанныеДокумента
	|ИЗ
	|	&ТЗ КАК ТЗ
	|ГДЕ
	|	НЕ ТЗ.ОсвободитьОтНазначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рин1_НазначенияСотрудниковВРЦСрезПоследних.Сотрудник КАК Сотрудник,
	|	Рин1_НазначенияСотрудниковВРЦСрезПоследних.ВРЦ КАК ВРЦ
	|ПОМЕСТИТЬ ВТ_ТекущиеДанныеРегистра
	|ИЗ
	|	РегистрСведений.Рин1_НазначенияСотрудниковВРЦ.СрезПоследних(
	|			,
	|			ВРЦ В
	|				(ВЫБРАТЬ
	|					ВТ_ТекущиеДанныеДокумента.ВРЦ КАК ВРЦ
	|				ИЗ
	|					ВТ_ТекущиеДанныеДокумента КАК ВТ_ТекущиеДанныеДокумента)) КАК Рин1_НазначенияСотрудниковВРЦСрезПоследних
	|ГДЕ
	|	НЕ Рин1_НазначенияСотрудниковВРЦСрезПоследних.ОсвободитьОтНазначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущиеДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ТекущиеДанныеДокумента.ВРЦ КАК ВРЦ
	|ПОМЕСТИТЬ ВТ_Общая
	|ИЗ
	|	ВТ_ТекущиеДанныеДокумента КАК ВТ_ТекущиеДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТекущиеДанныеРегистра.Сотрудник,
	|	ВТ_ТекущиеДанныеРегистра.ВРЦ
	|ИЗ
	|	ВТ_ТекущиеДанныеРегистра КАК ВТ_ТекущиеДанныеРегистра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Общая.Сотрудник) КАК КоличествоСотрудников,
	|	ВидыРабочихЦентров.КоличествоРабочихЦентров КАК КоличествоРабочихЦентров,
	|	ВТ_Общая.ВРЦ КАК ВРЦ
	|ИЗ
	|	ВТ_Общая КАК ВТ_Общая
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|		ПО ВТ_Общая.ВРЦ = ВидыРабочихЦентров.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыРабочихЦентров.КоличествоРабочихЦентров,
	|	ВТ_Общая.ВРЦ";
	
	ТЗ = Объект.ТабличнаяЧастьНазначений.Выгрузить();
	Запрос.УстановитьПараметр("ТЗ", ТЗ);  
	
	РезультатЗапроса = Запрос.Выполнить();
	//РезультатЗапроса.Выгрузить()
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоСотрудников  > ВыборкаДетальныеЗаписи.КоличествоРабочихЦентров Тогда
			ОбщегоНазначения.СообщитьПользователю("Лимит рабочих центров для врц " + ВыборкаДетальныеЗаписи.ВРЦ + " равный " + ВыборкаДетальныеЗаписи.КоличествоРабочихЦентров + " ,исчерпан. Назначение сотрудников не возможно!");
			ЕстьПревышение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьПревышение;
	
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧастьНазначенийСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МестоВСтруктуреПредприятия",Истина);
	
	ПараметрыОповещения = Элементы.ТабличнаяЧастьНазначений.ТекущиеДанные.НомерСтроки; //не нужна структура
	ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнительНачалоВыбораЗавершение",ЭтотОбъект,ПараметрыОповещения);
	
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Массив = Объект.ТабличнаяЧастьНазначений.НайтиСтроки(Новый Структура("НомерСтроки",Параметры));
		Если не Массив.Количество() = 0 Тогда
			Массив[0].Сотрудник = Результат;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
